Repository: 0verflowed-stack/PuzzleTimer
Catalog: PuzzleTimer/Languages/*.resx
Languages: russian

# AboutAuthor
source: About application
russian: Про приложение

# AboutText1
source: Version 1.0.0
russian: Версия 1.0.0

# AboutText2
source: Created by Dmytro Alyanakh
russian: Создано Дмитрием Альянахом

# AboutText3
source: For more information look on
russian: Больше информации на

source: Add
russian: Добавить

# Avg
source: Avarage
russian: Середнее

# Avg3Last
source: Avarage 3 last:
russian: Среднее 3 посл.:

# Avg5Last
source: Avarage 5 last:
russian: Среднее 5 посл.:

# AvgAll
source: Avarage all:
russian: Среднее всех:

# AvgAnySelected
source: selected:
russian: избранных:

source: Cancel
russian: Отменить

source: Chart
russian: График

# ChartWindowText
source: Time
russian: Время

source: Clear all
russian: Очистить всё

source: Copy to clipboard
russian: Копировать в буф. обмена

# CultureString
source: en-US
russian: ua-UA

# CustomScrambleWindowButtonCancel
source: Cancel
russian: Отмена

# CustomScrambleWindowButtonDone
source: Done
russian: Готово

# CustomScrambleWindowText
source: Enter custom scramble
russian: Введите собственный скрамбл

# DateToolTipText
source: month/day/year hour:minute:second
russian: месяц/день/год час:минута:секунда

source: Delete
russian: Удалить

source: Edit
russian: Правка

source: Generating...
russian: Генерирование...

# GridHeaderPuzzleNameText
source: Puzzle type
russian: Тип головоломки

# GridHeaderScrambleText
source: Scramble
russian: Скрамбл

# GridHeaderSolutionDateText
source: Solution date
russian: Дата сборки

# GridHeaderSolutionTimeText
source: Solution time
russian: Время сборки

source: Help
russian: Помощь

# HelpText1
source: Quick guide:
russian: Краткое руководство:

# HelpText10
source: 9. To show avarage solution time on custom number of items input appropriet number in the bottom of the window or select items(lines) for those it is need to find avarage solution time and it will show in the bottom of the window;
russian: 9. Чтобы увидеть среднее время сборки любого количества последних записей введите соответвующее число внизу окна или выделите записи для которых нужно найти середнее время сборки и оно появится в нижней части экрана;

# HelpText11
source: 10. You can change your current puzzle in combo box in the bottom of the screen;
russian: 10. Изменить головоломку можна в выпадающем меню в нижней части окна;

# HelpText12
source: 11. On main window button New scramble generates new scramble. Button Table/Unfold shows table/unfold accordingly;
russian: 11. На главном окне кнопка Новый скрамбл генерирует новый скрамбл. Кнопка Таблица/Развертка показывает таблицу/развуртку соответственно;

# HelpText2
source: 1.To start timer press Space button for more then 1 second and then unpress, to stop press Space button again;
russian: 1. Чтобы запустить таймер, нажмите кнопку «Пробел» и удерживайте её более 1 секунды, а затем отпустите, для остановки нажмите кнопку «Пробел» ещё раз;

# HelpText3
source: 2.To use scrambles for 2x2-7x7 you must hold your cube this way: Front - Green, Left - Orange;For Skweb: Up - White, Left - Green; For Pyraminx: Front - Green, Left - Red; For Megaminx: Up - White, Front - Dark Green;
russian: 2. Чтобы использовать скрамблы для 2x2-7x7, вы должны держать свой куб так: Перёд - Зелёный, Слева - Оранжевый; Для Skewb: Верх - Белый, Слева - Зелёный; Для Pyraminx: Перёд - Зелёный, Слева - Красное; Для Megaminx: Верх - Белый, Перёд - Темнозелёный;

# HelpText4
source: 3.Double-click row to enter update menu or select row and click Edit->Update;
russian: 3. Дважды нажмите на строку в таблице, чтобы войти в меню обновления, или выберите строку и нажмите Правка-> Обновить;

# HelpText5
source: 4.Click on pencil on the main screen to input custom scramble;
russian: 4. Нажмите на карандаш на главном экране, чтобы ввести свой скрамбл;

# HelpText6
source: 5. In menu item Help->Settings you can change theme and language of the application;
russian: 5. В пункте меню Помощь->Настройки можна изменить тему и язык приложения;

# HelpText7
source: 6. In Edit menu item you can Add, Clear all items; Update and Delete (also by clicking delete button after selection of line or lines) item if appropriate line was selected in table. Also you can copy main information about solution to share if appropriate line was selected in table.
russian: 6. В пункте меню Правка можна Добавить записи, Удалить все записи; Обновить или Удалить (также с помощю кнопки delete на клавиатуре после вибора записи или записей) записи, если соответвующая ленейка была выбрана в таблице. Также можна копировать основную информацию про сборку, чтобы поделиться, если соответвующая ленейка была выбрана в таблице;

# HelpText8
source: 7. To see chart on current puzzle click on menu item Chart;
russian: 7. Чтобы увидеть график по данной головоломке нажмите на пункт меню График;

# HelpText9
source: 8. If you want to hide stopwatch while solving puzzle uncheck "Show time" checkbox;
russian: 8. Чтобы не видеть секундомер во время сборки уберите птичку в "Показать время";

# incorrectDate
source: INCORRECT SOLUTION DATE
russian: НЕПРАВИЛЬНАЯ ДАТА СБОРКИ

source: INCORRECT SCRAMBLE
russian: НЕПРАВИЛЬНЫЙ СКРАМБЛ

# incorrectScramblePlus
source: , SCRAMBLE
russian: , СКРАМБЛ

# incorrectTime
source: INCORRECT SOLUTION TIME
russian: НЕПРАВИЛЬНОЕ ВРЕМЯ СБОРКИ

# incorrectTimePlus
source: , SOLUTION TIME
russian: , ВРЕМЯ СБОРКИ

source: Language:
russian: Язык:

source: last:
russian: посл.:

source: New Scramble
russian: Новый скрамбл

# PuzzleType
source: Selected puzzle:
russian: Избранная головоломка:

source: Save
russian: Сохранить

source: Scramble:
russian: Скрамбл:

source: Settings
russian: Настройки

source: Show time
russian: Показать время

source: Solution date:
russian: Дата сборки:

source: Solution time:
russian: Время сборки:

# SolutionTimeTextBoxToolTipText
source: Examples Hours:Minutes:Seconds.Milliseconds(only first two digits, f.e. if 63 ms then write 0.06, 727 ms then 0.72)
russian: Пример: часы:минуты:секунды.милисекунды(только первые две цифры, например, если 63 милисекунды, тогда пишите 0.06, 727 милесекунд тогда 0.72)

source: Table
russian: Таблица

source: Theme:
russian: Тема:

source: Unfold
russian: Развертка

source: Update
russian: Обновить

source: Zero items! Can't draw chart!
russian: Нету записей! Невозможно построить график!
